src/DataProcessors/СписаниеГотовойПродукцииТНП/СписаниеГотовойПродукцииТНП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СписаниеГотовойПродукцииТНП</name>
  <tabularSections>
    <name>ТаблицаОшибок</name>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/Documents/СписаниеМПЗПрочее/СписаниеМПЗПрочее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеМПЗПрочее</name>
  <basedOn>Document.ИнвентаризацияМПЗ</basedOn>
  <basedOn>Document.ДвижениеМПЗ</basedOn>
  <basedOn>Document.ПоступлениеМПЗ</basedOn>
  <basedOn>Document.Перепрогон</basedOn>
  <basedOn>Document.ЗаявкаОтПокупателя</basedOn>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <registerRecords>AccumulationRegister.ГТД</registerRecords>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.РезервированиеГП</registerRecords>
  <registerRecords>AccumulationRegister.БракПроизводства</registerRecords>
  <registerRecords>AccumulationRegister.ЗаявкиОтПокупателей</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ДвижениеМПЗ</types>
      <types>DocumentRef.ПоступлениеНаЛинейку</types>
      <types>DocumentRef.Разукомплектовка</types>
      <types>DocumentRef.Перепрогон</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.ИнвентаризацияМПЗ</types>
      <types>DocumentRef.ПроизводственноеЗадание</types>
      <types>DocumentRef.ПоступлениеМПЗПрочее</types>
      <types>DocumentRef.ВыпускПродукцииКанбан</types>
      <types>DocumentRef.ПоступлениеМПЗ</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиПоступленийСписанийПрочих</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыНеисправностей</types>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ВидМПЗ</name>
      <type>
        <types>EnumRef.ВидыМПЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Материалы/Материалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Материалы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PartNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидБрака</name>
    <type>
      <types>CatalogRef.ВидыБрака</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериала</name>
    <type>
      <types>CatalogRef.ВидыМатериалов</types>
    </type>
  </attributes>
  <attributes>
    <name>Возвратный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВариабельности</name>
    <type>
      <types>EnumRef.ГруппыВариабельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПоЗакупкам</name>
    <type>
      <types>EnumRef.ГруппыПоЗакупкам</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПересмотра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИВХ</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаХранения</name>
    <type>
      <types>EnumRef.ЗоныХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>CatalogRef.Документация</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторВнесения</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Каталогизатор</name>
    <type>
      <types>CatalogRef.Каталогизатор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКЗаказу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьГрупповойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьЗаготовки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьИндивидуальнойУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьУпаковки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Критичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоЗакупкам</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МинОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеSMD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормативРабочейЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеМодели</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОсновныеЕдиницыИзмерений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПиковыеПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолнНаименование</name>
    <comment>Полное наименование, краткие характеристики</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакНеделимойУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВнесения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Производители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрослеживаемыйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПоЕСКД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтраховойЗапас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНормированияЗакупок</name>
    <type>
      <types>EnumRef.ТипыНормированияЗакупок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоставки</name>
    <type>
      <types>EnumRef.ТипыПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРиска</name>
    <type>
      <types>EnumRef.ТипыРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходнойКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фасовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаФактическаяНачГода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапЖизненногоЦикла</name>
    <type>
      <types>CatalogRef.ЭтапыЖизненногоЦикла</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтационарныеПитатели</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Замены</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщики</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КоммерческиеПредложения</name>
    <attributes>
      <name>КП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБыло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/СписаниеГотовойПродукцииТНП/Forms/Форма/Module.bsl
&НаСервере
Процедура СписаниеТНПНаСервере()
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;	
		Если ТаблицаРеализаций.Количество() > 0 Тогда	
		Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
		Списание.Дата = ТекущаяДата();
		Списание.Подразделение = МестоХраненияТНП.Подразделение;
		Списание.МестоХранения = МестоХраненияТНП;
		Списание.Статья = СтатьяСписанияРеализаций;
		Списание.Утвердил = Справочники.Сотрудники.НайтиПоНаименованию("Мартьянова Лариса Алексеевна");
		Списание.Комментарий = "Выгрузка реализаций ТНП из БД Сбыт";
			Для каждого ТЧ Из ТаблицаРеализаций Цикл
			ТЧ_МПЗ = Списание.ТабличнаяЧасть.Добавить();
			ТЧ_МПЗ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
			ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
			ТЧ_МПЗ.Количество = ТЧ.Количество;
			ТЧ_МПЗ.ЕдиницаИзмерения = ТЧ.МПЗ.ОсновнаяЕдиницаИзмерения;
			КонецЦикла; 
		Списание.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Создан документ "+Списание.Ссылка);	
		КонецЕсли;
			Если ТаблицаСписаний.Количество() > 0 Тогда	
			Списание = Документы.СписаниеМПЗПрочее.СоздатьДокумент();
			Списание.Дата = ТекущаяДата();
			Списание.Подразделение = МестоХраненияТНП.Подразделение;
			Списание.МестоХранения = МестоХраненияТНП;
			Списание.Статья = СтатьяСписанияСписаний;
			Списание.Утвердил = Справочники.Сотрудники.НайтиПоНаименованию("Мартьянова Лариса Алексеевна");
			Списание.Комментарий = "Выгрузка списаний ТНП из БД Сбыт";
				Для каждого ТЧ Из ТаблицаСписаний Цикл
				ТЧ_МПЗ = Списание.ТабличнаяЧасть.Добавить();
				ТЧ_МПЗ.ВидМПЗ = Перечисления.ВидыМПЗ.Материалы;
				ТЧ_МПЗ.МПЗ = ТЧ.МПЗ;
				ТЧ_МПЗ.Количество = ТЧ.Количество;
				ТЧ_МПЗ.ЕдиницаИзмерения = ТЧ.МПЗ.ОсновнаяЕдиницаИзмерения;
				КонецЦикла; 
			Списание.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Создан документ "+Списание.Ссылка);	
			КонецЕсли;
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;	
	Исключение
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Сообщить(ОписаниеОшибки())
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура СозданиеТаблицСписанияТНП(Тип,Наименование,Код,Количество)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Материалы.Ссылка
	|ИЗ
	|	Справочник.Материалы КАК Материалы
	|ГДЕ
	|	Материалы.Товар.Код = &Код";
Запрос.УстановитьПараметр("Код", Число(Код));
РезультатЗапроса = Запрос.Выполнить();
ВыборкаТНП = РезультатЗапроса.Выбрать();
	Если ВыборкаТНП.Количество() > 0 Тогда
		Пока ВыборкаТНП.Следующий() Цикл
			Если Тип = "Реализация" Тогда
			Выборка = ТаблицаРеализаций.НайтиСтроки(Новый Структура("МПЗ",ВыборкаТНП.Ссылка));
				Если Выборка.Количество() = 0 Тогда
				ТЧ = ТаблицаРеализаций.Добавить();
				ТЧ.МПЗ = ВыборкаТНП.Ссылка;
				ТЧ.Количество = Количество;
				Иначе
				Выборка[0].Количество = Выборка[0].Количество + Количество;
				КонецЕсли;
			Иначе
			Выборка = ТаблицаСписаний.НайтиСтроки(Новый Структура("МПЗ",ВыборкаТНП.Ссылка));
				Если Выборка.Количество() = 0 Тогда
				ТЧ = ТаблицаСписаний.Добавить();
				ТЧ.МПЗ = ВыборкаТНП.Ссылка;
				ТЧ.Количество = Количество;
				Иначе
				Выборка[0].Количество = Выборка[0].Количество + Количество;
				КонецЕсли;			
			КонецЕсли; 
		КонецЦикла;
	Иначе
	ТЧ = Объект.ТаблицаОшибок.Добавить();
	ТЧ.МПЗ = Наименование;
	ТЧ.Код = Код;
	ТЧ.Количество = Количество;
	ТЧ.Комментарий = "не найден!";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьТаблицыСписаний()
ТЗ = Новый ТаблицаЗначений;

ТЗ = ТаблицаРеализаций.Выгрузить();
	Для каждого ТЧ Из ТаблицаСписаний Цикл
	ТЧ_ТЗ = ТЗ.Добавить();
	ТЧ_ТЗ.МПЗ = ТЧ.МПЗ;
	ТЧ_ТЗ.Количество = ТЧ.Количество;
	КонецЦикла;
ТЗ.Свернуть("МПЗ","Количество");	
	Для каждого ТЧ Из ТЗ Цикл
	КоличествоНаСкладе = ОбщийМодульРаботаСРегистрами.ПолучитьОстатокПоМестуХранения(МестоХраненияТНП,ТЧ.МПЗ);
		Если КоличествоНаСкладе < ТЧ.Количество Тогда
		ТЧ_ТО = Объект.ТаблицаОшибок.Добавить();
		ТЧ_ТО.МПЗ = ТЧ.МПЗ;
		ТЧ_ТО.Код = ТЧ.МПЗ.Товар.Код;
		ТЧ_ТО.Количество = ТЧ.Количество;
		ТЧ_ТО.Комментарий = "не хватает на складе!";
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
 
&НаКлиенте
Процедура СоздатьСписания(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		Если Элементы.СписокФайловВыгрузки.ТекущаяСтрока <> Неопределено Тогда
		Результат = ОбщийМодульКлиент.ОткрытьФайлExcel("",Элементы.СписокФайловВыгрузки.ТекущиеДанные.Значение);
			Если Результат <> Неопределено Тогда
			Объект.ТаблицаОшибок.Очистить();
			ТаблицаРеализаций.Очистить();
			ТаблицаСписаний.Очистить();
			ExcelЛист = Результат.ExcelЛист;
			КолСтрок = Результат.КоличествоСтрок;
			    Для к = 2 по КолСтрок Цикл
				Состояние("Обработка...",к*100/КолСтрок,"Создание таблиц списания ТНП...");
		        СозданиеТаблицСписанияТНП(СокрЛП(ExcelЛист.Cells(к,5).Value),СокрЛП(ExcelЛист.Cells(к,2).Value),Число(ExcelЛист.Cells(к,3).Value),Число(ExcelЛист.Cells(к,4).Value));
			    КонецЦикла;
			Результат.Excel.Quit();
			КонецЕсли;
		ТаблицаРеализаций.Сортировать("МПЗ");
		ТаблицаСписаний.Сортировать("МПЗ");
		ПроверитьТаблицыСписаний();
			Если Объект.ТаблицаОшибок.Количество() = 0 Тогда
			Состояние("Обработка...",,"Списание ТНП...");
			СписаниеТНПНаСервере();
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
МассивНайденных = НайтиФайлы(Константы.КаталогОбменаДаннымиТНП.Получить(), "*.*",Истина);
	Для Каждого Файл из МассивНайденных Цикл	
		Если Не Файл.ЭтоФайл() Тогда
		Продолжить;		
		КонецЕсли;
	СписокФайловВыгрузки.Добавить(Файл.ПолноеИмя,Файл.Имя);
	КонецЦикла;
КонецПроцедуры

&НаСервере 
Функция ПолучитьКаталогОбменаДаннымиТНП()
Возврат(Константы.КаталогОбменаДаннымиТНП.Получить());
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
//ОбновитьНаСервере();
Путь = ПолучитьКаталогОбменаДаннымиТНП();
	Если ЗначениеЗаполнено(Путь) Тогда
	МассивНайденных = НайтиФайлы(Путь, "*.*",Истина);
		Для Каждого Файл из МассивНайденных Цикл	
			Если Не Файл.ЭтоФайл() Тогда
			Продолжить;		
			КонецЕсли;
		СписокФайловВыгрузки.Добавить(Файл.ПолноеИмя,Файл.Имя);
		КонецЦикла;
	Иначе
	Сообщить("В настройках не задан каталог обмена данными ТНП!");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Обновить(Неопределено);
КонецПроцедуры
